app/controllers/attire_controller.rb

SELECT "attires".* FROM "attires"
---
  def index
    attires = Attire.all