app/controllers/rendezvous_type_controller.rb

SELECT "rendezvous_types".* FROM "rendezvous_types"
---
  def index
    rendezvous_types = RendezvousType.all