app/controllers/rendezvou_controller.rb

INSERT INTO "rendezvous" ("date", "location", "user_id", "attire_id", "rendezvous_type_id", "created_at", "updated_at", "babysitter", "time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    rendezvous = Rendezvou.create(rendezvou_params)

SELECT "rendezvous".* FROM "rendezvous"
---
  def index
    rendezvous = Rendezvou.all

SELECT  "rendezvous".* FROM "rendezvous" WHERE "rendezvous"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def show
    rendezvou = Rendezvou.find_by(id: params[:id])

SELECT  "rendezvous".* FROM "rendezvous" WHERE "rendezvous"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
UPDATE "rendezvous" SET "time" = $1, "updated_at" = $2 WHERE "rendezvous"."id" = $3  [["time", "2019-07-30 19:00:00"], ["updated_at", "2019-07-30 22:53:32.998504"], ["id", 41]]
---
  def update
    rendezvou = Rendezvou.find_by(id: params[:id])
    rendezvou.update(rendezvou_params)

SELECT  "rendezvous".* FROM "rendezvous" WHERE "rendezvous"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "rendezvous" WHERE "rendezvous"."id" = $1  [["id", 25]]
---
  def destroy
    rendezvou = Rendezvou.find_by(id: params[:id])
    rendezvou.destroy