app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "phone_number", "email", "significant_other_phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "significant_other_phone" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["significant_other_phone", "999-999-9991"], ["updated_at", "2019-07-29 19:12:34.828810"], ["id", 1]]
---
  def update
    user = User.find_by(id: params[:id])
    user.update(user_params)